import * as React from 'react';
import { StyleSheet } from 'react-native';
import type { SvgProps } from 'react-native-svg';
import Svg, { Path } from 'react-native-svg';

import { isRTL } from '@/lib';
import { getSize } from '@/lib/hooks/use-responsive-dimensions';

export function Home({ color = '#000', style, ...props }: SvgProps) {
  const size = getSize(25); // Điều chỉnh kích thước theo màn hình
  return (
    <Svg
      width={size}
      height={size}
      viewBox="0 0 24 24"
      fill="none"
      {...props}
      style={StyleSheet.flatten([
        style,
        { transform: [{ scaleX: isRTL ? -1 : 1 }] },
      ])}
    >
      <Path
        d="M18.0999 23.0601H6.89985C5.07984 23.0601 3.41985 21.6601 3.11985 19.8601L1.78984 11.9001C1.57984 10.6601 2.17985 9.07011 3.16985 8.28011L10.0999 2.73006C11.4399 1.65006 13.5498 1.66007 14.8998 2.74007L21.8299 8.28011C22.8099 9.07011 23.4099 10.6601 23.2099 11.9001L21.8799 19.8601C21.5799 21.6301 19.8899 23.0601 18.0999 23.0601ZM12.4899 3.44008C11.9599 3.44008 11.4298 3.60005 11.0398 3.91005L4.10985 9.4601C3.53985 9.9201 3.14986 10.9401 3.26986 11.6601L4.59986 19.6201C4.77986 20.6701 5.82984 21.5601 6.89985 21.5601H18.0999C19.1699 21.5601 20.2198 20.6701 20.3998 19.6101L21.7298 11.6501C21.8498 10.9301 21.4499 9.90009 20.8899 9.45009L13.9599 3.91005C13.5599 3.60005 13.0299 3.44008 12.4899 3.44008Z"
        fill={color}
      />
      <Path
        d="M12.5 16.75C10.71 16.75 9.25 15.29 9.25 13.5C9.25 11.71 10.71 10.25 12.5 10.25C14.29 10.25 15.75 11.71 15.75 13.5C15.75 15.29 14.29 16.75 12.5 16.75ZM12.5 11.75C11.54 11.75 10.75 12.54 10.75 13.5C10.75 14.46 11.54 15.25 12.5 15.25C13.46 15.25 14.25 14.46 14.25 13.5C14.25 12.54 13.46 11.75 12.5 11.75Z"
        fill={color}
      />
    </Svg>
  );
}
